{
"Cel":"Projektünk célja egy leszármazotti függőségeket tartalmazó adatstruktúra modell bemutatása, a ragadozók kladisztikus osztályozási módszerének példáján keresztül. Az adatstruktúra kezelést és megértését interaktív genogrammal (kladisztikus genetikai családfa), illetve további adminisztrációs felületekkel és funkciókkal szemléltetjük.",
"Rendszertan":"A biológiában a rendszertan (taxonómia) az élőlények csoportosításával, leírásával, elnevezésével foglalkozó tudományág. Két szakterülete a szisztematika, amely az élőlények evolúciós rokonsági viszonyainak kutatásával foglalkozó tudomány és a taxonómia, amely az elnevezésekkel és katalogizálásokkal foglalkozó biológiai segédtudomány.",
"Monofiletikus":"A biológiai rendszertanban monofilumnak vagy monofiletikus csoportnak nevezzük az egy közös rendszertani őstől származó élőlények összességét (vagyis az őst és összes leszármazottját együttesen). Pl.: A madarakat általában monofiletikusnak tekintjük, a hüllőket viszont csak akkor tekinthetjük monofiletikusnak, ha a madarakat is közéjük értjük, hiszen azok ősi hüllőkből (theropoda dinoszauruszokból) fejlődtek ki.",
"Klad":"A kladisztikában élőlények olyan csoportját nevezzük kládnak, melyek egyetlen közös ősből és annak valamennyi leszármazottjából állnak. Minden ilyen csoport monofiletikusnak tekinthető, és kladogrammal modellezhető (ez egy fastruktúrájú diagram).",
"Faj":"A biológiában a faj (species) a biológiai rendszerezés alapegységei közé tartozik, egyben taxonómiai szint. A leggyakoribb értelmezés szerint élőlények olyan csoportja, melynek egyedei képesek szaporodni egymással, és termékeny utódokat létrehozni. A fajfogalom filozófiai értelmezését Arisztotelész kezdte használni és alkalmazni az élőlényekre, Carl von Linné és más tudósok később tökéletesítették használatát és pontosították értelmezését.",
"Ragadozó":"A ragadozók (Carnivora) az emlősök (Mammalia) osztályának egy rendje. A ragadozó főleg hússal táplálkozik, amit zsákmányolással vagy dögevőként szerez meg. A macskafélék szinte kizárólag húson élnek, a medvefélék és a rókák inkább mindenevők. A ragadozók legidősebb közös őse, a Creodont valamivel több mint száz millió éve élt az északi féltekén. A ma élő családok közös ősének a Miacist, ez a mintegy 50millió éve (az eocén időszakban) élt menyét nagyságú, hosszú farkú és rövid lábú, fán élő ősragadozót tekintik.",
"Természetvédelmi":"A természetvédelmi státusz az egyes élőlényfajok állományának helyzetét jellemző kategória.",
"Tűrőképesség":"Az alkalmazkodás mértéke a tűrőképesség. A tűrőképesség az élőlények alkalmazkodóképességét jelenti a különféle időben és térben változó környezeti tényezőkkel szemben. Jelen projektben két környezeti tényezőt veszünk figyelembe: a térbeli elterjedséget és a táplálkozási módot. Ebből kifolyólag most megkülönböztetünk specialistát (szűk tűrésű faj) és generalistát (tág tűrésű faj)."
}
